Revit 2027 API
IFCProductWrapper.AddBuilding Method
 Adds an IfcBuilding handle to associate with the IfcProduct in this wrapper.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddBuilding(
	IFCAnyHandle buildingHandle
)
Public Sub AddBuilding (
	buildingHandle As IFCAnyHandle
)
public:
void AddBuilding(
	IFCAnyHandle^ buildingHandle
)
member AddBuilding :
        buildingHandle : IFCAnyHandle -> unit
Parameters
buildingHandle IFCAnyHandle
 The IfcBuilding handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace